@add
    Входные данные: 2,3
    Выходные данные: 5
    
    Входные данные: -3,2
    Выходные данные: -1

    Входные данные: 2.9, 3
    Выходные данные: 5.9

    Входные данные: 2, "2"
    Выходные данные: TypeError

    Входные данные: [], ()
    Выходные данные: TypeError


@substract
    Входные данные: 2, 3
    Выходные данные: -1

    Входные данные: -3, 2
    Выходные данные: -5

    Входные данные: 2.9, 3
    Выходные данные: -0.1

    Входные данные: 2, "2"
    Выходные данные: TypeError

    Входные данные: [], ()
    Выходные данные: TypeError


@multiply
    Входные данные: 2, 3
    Выходные данные: 6

    Входные данные: -3, 2
    Выходные данные: -6

    Входные данные: 2.9, 3
    Выходные данные: 8.7

    Входные данные: 2, "2"
    Выходные данные: TypeError

    Входные данные: [], ()
    Выходные данные: TypeError


@divide
    Входные данные: 3, 2
    Выходные данные: 1.5

    Входные данные: -3, 2
    Выходные данные:-1.5

    Входные данные: 2, 2.5
    Выходные данные: 0.8

    Входные данные: 2, "2"
    Выходные данные: TypeError

    Входные данные: [], ()
    Выходные данные: TypeError
    
    Входные данные: 3,0
    Выходные данные: ZeroDivisionError
    